IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_epwm_regs.xml
	<register id="ETINTMIXEN" width="16" page="1" offset="0xb6" internal="0" description="Event-Trigger Mixed INT Selection">
		<bitfield id="ZRO" description="Zero match enable to ETINTMIX" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PRD" description="Period match enable to ETINTMIX" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CAU" description="CMPA up-count match enable to ETINTMIX" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CAD" description="CMPA down-count match enable to ETINTMIX" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CBU" description="CMPB up-count match enable to ETINTMIX" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CBD" description="CMPB down-count match enable to ETINTMIX" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CCU" description="CMPC up-count match enable to ETINTMIX" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CCD" description="CMPC down-count match enable to ETINTMIX" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CDU" description="CMPD up-count match enable to ETINTMIX" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CDD" description="CMPD down-count match enable to ETINTMIX" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT1" description="DCAEVT1.inter enable to ETINTMIX" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="ETSOCAMIXEN" width="16" page="1" offset="0xb8" internal="0" description="Event-Trigger Mixed SOCA Selection">
		<bitfield id="ZRO" description="Zero match enable to ETSOCAMIX" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PRD" description="Period match enable to ETSOCAMIX" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CAU" description="CMPA up-count match enable to ETSOCAMIX" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CAD" description="CMPA down-count match enable to ETSOCAMIX" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CBU" description="CMPB up-count match enable to ETSOCAMIX" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CBD" description="CMPB down-count match enable to ETSOCAMIX" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CCU" description="CMPC up-count match enable to ETSOCAMIX" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CCD" description="CMPC down-count match enable to ETSOCAMIX" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CDU" description="CMPD up-count match enable to ETSOCAMIX" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CDD" description="CMPD down-count match enable to ETSOCAMIX" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT1" description="DCAEVT1.inter enable to ETSOCAMIX" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="ETSOCBMIXEN" width="16" page="1" offset="0xba" internal="0" description="Event-Trigger Mixed SOCB Selection">
		<bitfield id="ZRO" description="Zero match enable to ETSOCBMIX" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PRD" description="Period match enable to ETSOCBMIX" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CAU" description="CMPA up-count match enable to ETSOCBMIX" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CAD" description="CMPA down-count match enable to ETSOCBMIX" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CBU" description="CMPB up-count match enable to ETSOCBMIX" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CBD" description="CMPB down-count match enable to ETSOCBMIX" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CCU" description="CMPC up-count match enable to ETSOCBMIX" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CCD" description="CMPC down-count match enable to ETSOCBMIX" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CDU" description="CMPD up-count match enable to ETSOCBMIX" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CDD" description="CMPD down-count match enable to ETSOCBMIX" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT1" description="DCBEVT1.inter enable to ETSOCBMIX" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="DCTRIPSEL" width="16" page="1" offset="0xc0" internal="0" description="Digital Compare Trip Select Register">
		<bitfield id="DCAHCOMPSEL" description="Digital Compare A High COMP Input Select " begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="DCALCOMPSEL" description="Digital Compare A Low COMP Input Select " begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="DCBHCOMPSEL" description="Digital Compare B High COMP Input Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="DCBLCOMPSEL" description="Digital Compare B Low COMP Input Select" begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
	<register id="DCACTL" width="16" page="1" offset="0xc3" internal="0" description="Digital Compare A Control Register">
		<bitfield id="EVT1SRCSEL" description="DCAEVT1 Source Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EVT1FRCSYNCSEL" description="DCAEVT1 Force Sync Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EVT1SOCE" description="DCAEVT1 SOC Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EVT1SYNCE" description="DCAEVT1 SYNC Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EVT1LATSEL" description="DCAEVT1 Latched signal select" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVT1LATCLRSEL" description="DCAEVT1 Latched clear source select" begin="6" end="5" width="2" rwaccess="RW"/>
		<bitfield id="EVT1LAT" description="Indicates the status of DCAEVT1LAT signal." begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EVT2SRCSEL" description="DCAEVT2 Source Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EVT2FRCSYNCSEL" description="DCAEVT2 Force Sync Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EVT2LATSEL" description="DCAEVT2 Latched signal select" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EVT2LATCLRSEL" description="DCAEVT2 Latched clear source select" begin="14" end="13" width="2" rwaccess="RW"/>
		<bitfield id="EVT2LAT" description="Indicates the status of DCAEVT2LAT signal." begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="DCBCTL" width="16" page="1" offset="0xc4" internal="0" description="Digital Compare B Control Register">
		<bitfield id="EVT1SRCSEL" description="DCBEVT1 Source Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EVT1FRCSYNCSEL" description="DCBEVT1 Force Sync Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EVT1SOCE" description="DCBEVT1 SOC Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EVT1SYNCE" description="DCBEVT1 SYNC Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EVT1LATSEL" description="DCBEVT1 Latched signal select" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVT1LATCLRSEL" description="DCBEVT1 Latched clear source select" begin="6" end="5" width="2" rwaccess="RW"/>
		<bitfield id="EVT1LAT" description="Indicates the status of DCBEVT1LAT signal." begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EVT2SRCSEL" description="DCBEVT2 Source Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EVT2FRCSYNCSEL" description="DCBEVT2 Force Sync Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EVT2LATSEL" description="DCBEVT2 Latched signal select" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EVT2LATCLRSEL" description="DCBEVT2 Latched clear source select" begin="14" end="13" width="2" rwaccess="RW"/>
		<bitfield id="EVT2LAT" description="Indicates the status of DCBEVT2LAT signal." begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="DCFCTL" width="16" page="1" offset="0xc7" internal="0" description="Digital Compare Filter Control Register">
		<bitfield id="SRCSEL" description="Filter Block Signal Source Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="BLANKE" description="Blanking Enable/Disable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="BLANKINV" description="Blanking Window Inversion" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PULSESEL" description="Pulse Select for Blanking and Capture Alignment" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="EDGEFILTSEL" description="Edge Filter Select" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EDGEMODE" description="Edge Mode" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="EDGECOUNT" description="Edge Count" begin="12" end="10" width="3" rwaccess="RW"/>
		<bitfield id="EDGESTATUS" description="Edge Status" begin="15" end="13" width="3" rwaccess="R"/>
	</register>
	<register id="DCCAPCTL" width="16" page="1" offset="0xc8" internal="0" description="Digital Compare Capture Control Register">
		<bitfield id="CAPE" description="Counter Capture Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SHDWMODE" description="Counter Capture Mode" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CAPSTS" description="Latched Status Flag for Capture Event" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="CAPCLR" description="DC Capture Latched Status Clear Flag" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CAPMODE" description="Counter Capture Mode" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="DCFOFFSET" width="16" page="1" offset="0xc9" internal="0" description="Digital Compare Filter Offset Register ">
		<bitfield id="DCFOFFSET" description="Blanking Offset" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="DCFOFFSETCNT" width="16" page="1" offset="0xca" internal="0" description="Digital Compare Filter Offset Counter Register">
		<bitfield id="DCFOFFSETCNT" description="Blanking Offset Counter" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
